<div class="box clearfix">
	<h2>О команде</h2>
	<div class="text-content">
		Tundra Esports — британская киберспортивная команда по Dota 2, добившаяся значительных успехов на международной арене. За свою историю, начиная с 2021 года, команда провела около 450 матчей, одержав примерно 260 побед. Пиком карьеры Tundra Esports стала победа на The International 2022, самом престижном турнире по Dota 2, принеся команде внушительный денежный приз в размере около 8,5 миллионов долларов. Команда неоднократно занимала призовые места на крупных турнирах, демонстрируя стабильно высокий уровень игры и входя в число лучших команд мира. За время существования в команде играло более 30 игроков.
	</div>
</div>

<style>
.text-content{
    padding: 30px;
}
</style>
